apps/ramen_app/app/controllers/member/base.rb

SELECT "ramen_members".* FROM "ramen_members" WHERE "ramen_members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
class Member::Base < ApplicationController
    private def login_member_now
        if session[:ramen_member_id]
            @login_member_now ||=
              RamenMember.find_by(id: session[:ramen_member_id])