apps/ramen_app/app/controllers/member/member_controller.rb

    def create
        @ramen_members = RamenMember.new(params[:ramen_member])
        if @ramen_members.save
---
INSERT INTO "ramen_members" ("email", "name", "hashed_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"