apps/ramen_app/app/controllers/member/posts_controller.rb

  def create
    @member_post = Member::Post.new(member_post_params)

    respond_to do |format|
      if @member_post.save
---
INSERT INTO "member_posts" ("title", "place", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["place", ""], ["image", "スクリーンショット_2020-08-03_17.01.58.png"], ["created_at", "2020-08-18 20:13:32.306539"], ["updated_at", "2020-08-18 20:13:32.306539"]]

  def update
    respond_to do |format|
      if @member_post.update(member_post_params)
---
UPDATE "member_posts" SET "updated_at" = $1 WHERE "member_posts"."id" = $2  [["updated_at", "2020-08-08 09:18:51.383822"], ["id", 4]]

  def destroy
    @member_post.destroy
---
DELETE FROM "member_posts" WHERE "member_posts"."id" = $1  [["id", 5]]