apps/ramen_app/app/controllers/member/sessions_controller.rb

    def create
        @form = Member::LoginForm.new(params[:member_login_form])
        if @form.email.present?
            ramen_member =
              RamenMember.find_by("LOWER(email) = ?", @form.email.downcase)
---
SELECT "ramen_members".* FROM "ramen_members" WHERE (LOWER(email) = 'kanki.m0924@gmail.com') LIMIT $1  [["LIMIT", 1]]